In [1]:
import sqlite3


conn = sqlite3.connect("employee.db")
c = conn.cursor()

c.execute("""CREATE TABLE employee_demographics (
  employee_id INT NOT NULL,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  age INT,
  gender VARCHAR(10),
  birth_date DATE,
  PRIMARY KEY (employee_id)
)""")


conn.commit()

In [2]:
c.execute("""CREATE TABLE employee_salary (
  employee_id INT NOT NULL,
  first_name VARCHAR(50) NOT NULL,
  last_name VARCHAR(50) NOT NULL,
  occupation VARCHAR(50),
  salary INT,
  dept_id INT
)""")

conn.commit()

In [3]:
c.execute("""INSERT INTO employee_demographics (employee_id, first_name, last_name, age, gender, birth_date)
VALUES
(1,'Leslie', 'Knope', 44, 'Female','1979-09-25'),
(3,'Tom', 'Haverford', 36, 'Male', '1987-03-04'),
(4, 'April', 'Ludgate', 29, 'Female', '1994-03-27'),
(5, 'Jerry', 'Gergich', 61, 'Male', '1962-08-28'),
(6, 'Donna', 'Meagle', 46, 'Female', '1977-07-30'),
(7, 'Ann', 'Perkins', 35, 'Female', '1988-12-01'),
(8, 'Chris', 'Traeger', 43, 'Male', '1980-11-11'),
(9, 'Ben', 'Wyatt', 38, 'Male', '1985-07-26'),
(10, 'Andy', 'Dwyer', 34, 'Male', '1989-03-25'),
(11, 'Mark', 'Brendanawicz', 40, 'Male', '1983-06-14'),
(12, 'Craig', 'Middlebrooks', 37, 'Male', '1986-07-27')""")
conn.commit()

In [4]:
c.execute("""INSERT INTO employee_salary (employee_id, first_name, last_name, occupation, salary, dept_id)
VALUES
(1, 'Leslie', 'Knope', 'Deputy Director of Parks and Recreation', 75000,1),
(2, 'Ron', 'Swanson', 'Director of Parks and Recreation', 70000,1),
(3, 'Tom', 'Haverford', 'Entrepreneur', 50000,1),
(4, 'April', 'Ludgate', 'Assistant to the Director of Parks and Recreation', 25000,1),
(5, 'Jerry', 'Gergich', 'Office Manager', 50000,1),
(6, 'Donna', 'Meagle', 'Office Manager', 60000,1),
(7, 'Ann', 'Perkins', 'Nurse', 55000,4),
(8, 'Chris', 'Traeger', 'City Manager', 90000,3),
(9, 'Ben', 'Wyatt', 'State Auditor', 70000,6),
(10, 'Andy', 'Dwyer', 'Shoe Shiner and Musician', 20000, NULL),
(11, 'Mark', 'Brendanawicz', 'City Planner', 57000, 3),
(12, 'Craig', 'Middlebrooks', 'Parks Director', 65000,1)""")
conn.commit()

In [9]:
c.execute("""CREATE TABLE parks_departments (
  department_id INTEGER PRIMARY KEY AUTOINCREMENT,
  department_name varchar(50) NOT NULL)""")
conn.commit()

In [10]:
c.execute("""INSERT INTO parks_departments (department_name)
VALUES
('Parks and Recreation'),
('Animal Control'),
('Public Works'),
('Healthcare'),
('Library'),
('Finance');
""")
conn.commit()

In [9]:
c.execute("SELECT gender, AVG(buy) FROM customers GROUP BY gender")
print(c.fetchall())

[('Female', 71.0), ('Male', 100.0)]

In [10]:
c.execute("SELECT gender, MIN(buy), MAX(buy), COUNT(buy),AVG(buy) FROM customers GROUP BY gender")
print(c.fetchall())

[('Female', 23, 100, 3, 71.0), ('Male', 50, 150, 2, 100.0)]

In [11]:
c.execute("SELECT * FROM customers ORDER BY first_name")
print(c.fetchall())

[('Minoo', 'Sayyadpour', 'Female', 'minoosayyadpour34@gmail.com', 90), ('Yalda', 'Goli', 'Female', 'yg@email.com', 23), ('customerName1', 'customerLastName1', 'Female', 'customer1@email.com', 100), ('customerName2', 'customerLastName2', 'Male', 'customer2@email.com', 150), ('customerName3', 'customerLastName3', 'Male', 'customer3@email.com', 50)]

In [13]:
c.execute("SELECT * FROM customers ORDER BY first_name DESC")
print(c.fetchall())

[('customerName3', 'customerLastName3', 'Male', 'customer3@email.com', 50), ('customerName2', 'customerLastName2', 'Male', 'customer2@email.com', 150), ('customerName1', 'customerLastName1', 'Female', 'customer1@email.com', 100), ('Yalda', 'Goli', 'Female', 'yg@email.com', 23), ('Minoo', 'Sayyadpour', 'Female', 'minoosayyadpour34@gmail.com', 90)]

In [14]:
c.execute("SELECT * FROM customers ORDER BY gender DESC, buy ASC")
print(c.fetchall())

[('customerName3', 'customerLastName3', 'Male', 'customer3@email.com', 50), ('customerName2', 'customerLastName2', 'Male', 'customer2@email.com', 150), ('Yalda', 'Goli', 'Female', 'yg@email.com', 23), ('Minoo', 'Sayyadpour', 'Female', 'minoosayyadpour34@gmail.com', 90), ('customerName1', 'customerLastName1', 'Female', 'customer1@email.com', 100)]

In [15]:
c.execute("SELECT * FROM customers ORDER BY 5 DESC, 4 DESC")
print(c.fetchall())

[('customerName2', 'customerLastName2', 'Male', 'customer2@email.com', 150), ('customerName1', 'customerLastName1', 'Female', 'customer1@email.com', 100), ('Minoo', 'Sayyadpour', 'Female', 'minoosayyadpour34@gmail.com', 90), ('customerName3', 'customerLastName3', 'Male', 'customer3@email.com', 50), ('Yalda', 'Goli', 'Female', 'yg@email.com', 23)]

## Having vs Where

- Both were created to filter rows of data, but they filter 2 separate things
- Where is going to filters rows based off columns of data
- Having is going to filter rows based off aggregated columns when grouped

In [17]:
c.execute("SELECT gender, AVG(buy) FROM customers GROUP BY gender HAVING AVG(buy) > 80")
print(c.fetchall())

[('Male', 100.0)]

## ALIASING

Aliasing is just a way to change the name of the column (for the most part), it can also be used in joins.

In [22]:
c.execute("SELECT gender, AVG(buy) AS BuyAverage FROM customers GROUP BY gender")
print(c.fetchall())

[('Female', 71.0), ('Male', 100.0)]

In [23]:
conn.close()